// Створи функцію asyncExecution, яка використовує асинхронність JavaScript для виведення на екран чисел від 1 до 5 з інтервалом в 1 секунду між виведеннями.

// Створи функцію generatePromise, яка повертає Promise, який вирішується через 2 секунди та повертає об'єкт зі словом "Success".


// Створи функцію errorHandling, яка повертає Promise та вирішується з помилкою через 1 секунду. Обробіть цю помилку та виведіть повідомлення.

// Створи ланцюг Promise, який виконує три послідовні асинхронні операції. Кожна наступна операція повинна використовувати результат попередньої.

// Створи послідовність асинхронних операцій, що демонструє ситуацію "Promise Hell", коли вкладені проміси та зворотні виклики ускладнюють код. Потім виправте це використовуючи async/await для полегшення читання та розуміння коду.